In [17]:
import pandas as pd

In [18]:
df1 = pd.DataFrame({'calisanlar': ['Ali','Veli','Ayse','Fatma'] ,
                    'grup': ['Muhasebe','Muhendislik','Muhendislik','İK']})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [31]:
df2 = pd.DataFrame({'calisanlar': ['Ayse','Ali','Veli','Fatma'] ,
                    'ilk_giris': ['2010','2009','2014','2019']})
df2

  calisanlar ilk_giris
0       Ayse      2010
1        Ali      2009
2       Veli      2014
3      Fatma      2019

In [32]:
pd.merge(df1, df2)

  calisanlar         grup ilk_giris
0        Ali     Muhasebe      2009
1       Veli  Muhendislik      2014
2       Ayse  Muhendislik      2010
3      Fatma           İK      2019

In [33]:
pd.merge(df1, df2, on= "calisanlar")

  calisanlar         grup ilk_giris
0        Ali     Muhasebe      2009
1       Veli  Muhendislik      2014
2       Ayse  Muhendislik      2010
3      Fatma           İK      2019

In [34]:
#coktan teke

In [35]:
df3 = pd.merge(df1, df2)
df3

  calisanlar         grup ilk_giris
0        Ali     Muhasebe      2009
1       Veli  Muhendislik      2014
2       Ayse  Muhendislik      2010
3      Fatma           İK      2019

In [36]:
df4 = pd.DataFrame({"grup": ["Muhasebe","Mühendislik","İK"],
                  "mudur": ["Caner","Mustafa","Berkcan"] })

In [37]:
df4

          grup    mudur
0     Muhasebe    Caner
1  Mühendislik  Mustafa
2           İK  Berkcan

In [38]:
pd.merge(df3,df4)

  calisanlar      grup ilk_giris    mudur
0        Ali  Muhasebe      2009    Caner
1      Fatma        İK      2019  Berkcan

In [39]:
#coktan coka

In [40]:
df5 = pd.DataFrame({"grup": ["Muhasebe","Muhasebe",
                            "Muhendislik","Muhendislik","İK","İK"],
                   "yetenekler": ["matematik","excel","kodlama","linux",
                                 "excel","yonetim"]})

In [41]:
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [43]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [42]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim